Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Typically one uses access tokens to access remote services but OIDC DevUI SPA dashboard also offers an option to test with the ID token. This option is only available to emulate the cases where SPA delegates to the endpoint to verify and retrieve some information from the ID token for SPA to use - but ID token will still be sent to the endpoint as Bearer token by OIDC DevUI. Prefer testing with the access token in most cases.
ja_jp: 通常、リモートサービスにアクセスするにはアクセストークンを使用しますが、OIDC DevUI SPA ダッシュボードには ID トークンを使用してテストするオプションもあります。このオプションは、SPA がエンドポイントに委譲して、SPA が使用するために ID トークンからいくつかの情報を検証および取得するケースをエミュレートするためにのみ使用できます。その場合も、ID トークンは OIDC DevUI によってベアラートークンとしてエンドポイントに送信されます。ほとんどの場合は、アクセストークンを使用してテストすることが推奨されます。

source: Typically you would need to adapt your build scripts to include the Hibernate Enhancement plugins; in Quarkus this is not necessary as the enhancement step is integrated in the build and analysis of the Quarkus application.
ja_jp: 通常、ビルドスクリプトにHibernateエンハンスメントプラグインを追加する必要がありますが、QuarkusではエンハンスメントステップがQuarkusアプリケーションのビルドと分析に統合されているため、その必要はありません。

source: Typically, Quarkus community users will not need to have any registry-related configuration in their environment. The registry hosted at <<registry.quarkus.io,registry.quarkus.io>> is enabled in all the Quarkus dev tools by default. However, there could be a few situations where a custom registry client configuration could help. For example, to change the local registry cache update policy or to configure additional (non-default) Quarkus extension registries.
ja_jp: 通常、Quarkusのコミュニティユーザーは、自分の環境でレジストリ関連の設定を行う必要はありません。 <<registry.quarkus.io,registry.quarkus.io>> にホストされているレジストリは、デフォルトですべてのQuarkus開発ツールで有効になっています。しかし、カスタムのレジストリクライアント設定が役立つ場面がいくつかあるかもしれません。例えば、ローカルレジストリキャッシュのアップデートポリシーの変更や、追加の（デフォルトではない）Quarkusエクステンションレジストリの設定などです。

source: Typically, Quarkus community users will not need to have any registry-related configuration in their environment. The registry hosted at xref:registry.quarkus.io[registry.quarkus.io] is enabled in all the Quarkus dev tools by default. However, there could be a few situations where a custom registry client configuration could help. For example, to change the local registry cache update policy or to configure additional (non-default) Quarkus extension registries.
ja_jp: 通常、Quarkusコミュニティユーザーは、自分の環境でレジストリに関連する設定を行う必要はないでしょう。 xref:registry.quarkus.io[registry.quarkus.io] でホストされているレジストリは、デフォルトですべてのQuarkus開発ツールで有効になっています。しかし、レジストリのクライアント設定をカスタマイズすることで、役立つ状況がいくつかあるかもしれません。例えば、ローカルレジストリキャッシュの更新ポリシーを変更したり、追加の（デフォルトではない）Quarkusエクステンションレジストリを設定したりする場合などです。

source: Typically, Quarkus must be configured with `quarkus.oidc.application-type=service` to support `Bearer` token authentication, but it also supports a `hybrid` application type, which means it can support both the authorization code and bearer token flows at the same time.
ja_jp: 通常、Quarkus は `ベアラー` トークン認証をサポートするために `quarkus.oidc.application-type=service` で設定する必要がありますが、 `hybrid` アプリケーションタイプもサポートしているため、認可コードとベアラートークンの両方のフローを同時にサポートできます。

source: Typically, a single project property will be used to manage all the Quarkus platform BOMs but the implementation isn't currently smart enough to point that out and will report updates for each BOM individually.
ja_jp: 通常、単一のプロジェクトプロパティーを使用してすべての Quarkus プラットフォーム BOM を管理しますが、現在の実装はその点を十分に考慮しておらず、各 BOM の更新が個別に報告されます。

source: Typically, client IDs and client secrets are defined for a given application when it enlists with the OIDC provider. All https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[OIDC client authentication] options are supported. For example:
ja_jp: 通常、クライアント ID とクライアントシークレットは、OIDC プロバイダーに登録する際に、特定のアプリケーションに対して定義されます。 https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[OIDC クライアント認証] のすべてのオプションがサポートされています。 例を挙げます。

source: Typically, client id and client secrets are defined for a given application when it enlists to the OIDC provider. All https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[OIDC client authentication] options are supported. For example:
ja_jp: 通常、クライアントIDとクライアントシークレットは、アプリケーションがOIDCプロバイダに登録する際に定義されます。 すべての link:https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[OIDCクライアント認証] オプションがサポートされています。 例:

source: Typically, in order to work with `SunPKCS11`, one needs to install a `PKCS#11` implementation, generate a configuration which usually refers to a shared library, token slot, etc and write the following Java code:
ja_jp: 通常、 `SunPKCS11` を扱うには、 `PKCS#11` の実装をインストールし、共有ライブラリやトークンスロットなどを参照する設定を生成し、以下のJavaコードを記述する必要があります。 :

source: Typically, in production, users that must login are guided to the central login URL first, as opposed to them accessing random secured paths and expecting to be returned to the very same original request paths, likely missing the context available from the central login endpoint. Instead, once the user lands at the secured central login page, this page redirects users further according to the application flow.
ja_jp: 通常、本番環境では、ログインが必要なユーザーはまず中央のログイン URL に誘導されます。ランダムな保護されたパスにアクセスして、まったく同じ元のリクエストパスに戻ることを期待するのとは対照的です。後者の場合、中央のログインエンドポイントから利用可能なコンテキストが失われる可能性があります。代わりに、ユーザーが保護された中央のログインページに到達すると、このページがアプリケーションのフローに従ってユーザーをさらにリダイレクトします。

source: Typically, one is loading a configuration to create some runtime component/service as `parseServiceXmlConfig` is doing. We will come back to the rest of the behavior in `parseServiceXmlConfig` in the following <<Manage Non-CDI Service>> section.
ja_jp: 通常、 `parseServiceXmlConfig` が実行しているように、設定をロードしてランタイムコンポーネント/サービスを作成します。 `parseServiceXmlConfig` の残りの動作については、<<非cdiサービスの管理>> セクションで説明します。

source: Typically, one is loading a configuration to create some runtime component/service as `parseServiceXmlConfig` is doing. We will come back to the rest of the behavior in `parseServiceXmlConfig` in the following <<manage-non-cdi-service>> section.
ja_jp: 通常、 `parseServiceXmlConfig` が実行しているように、設定をロードしてランタイムコンポーネント/サービスを作成します。 `parseServiceXmlConfig` の残りの動作については、<<manage-non-cdi-service>> セクションで説明します。

source: Typically, one is loading a configuration to create some runtime component/service as `parseServiceXmlConfig` is doing. We will come back to the rest of the behavior in `parseServiceXmlConfig` in the following xref:manage-non-cdi-service[Manage Non-CDI Service] section.
ja_jp: 通常、 `parseServiceXmlConfig` が行っているように、何らかの実行時コンポーネント/サービスを作成するために設定をロードしているのです。 `parseServiceXmlConfig` の残りの動作については、次の xref:manage-non-cdi-service[非CDIサービスの管理] のセクションで説明することにします。

source: Typically, this handler is used with the `quarkus-logging-json` extension to send logs in ECS format to an Elasticsearch instance. For an example configuration, see the xref:centralized-log-management.adoc[Centralized log management] guide.
ja_jp: 通常、このハンドラは `quarkus-logging-json` エクステンションと一緒に使用し、ECS 形式のログを Elasticsearch インスタンスに送信します。 設定例については、 xref:centralized-log-management.adoc[集中ログ管理] ガイドを参照してください。

source: Typically, you have to register an OIDC client (application) manually in your OIDC provider&#8217;s dashboard.
ja_jp: 通常、OIDCクライアント（アプリケーション）は、OIDCプロバイダーのダッシュボードで手動で登録する必要があります。

source: Typically, you have to register an OIDC client (application) manually in your OIDC provider's dashboard. During this process, you specify the human readable application name, allowed redirect and post logout URLs, and other properties. After the registration has been completed, you copy the generated client id and secret to your Quarkus OIDC application properties.
ja_jp: 通常、OIDC プロバイダーのダッシュボードで OIDC クライアント (アプリケーション) を手動で登録する必要があります。 このプロセスでは、人間が判読できるアプリケーション名、許可されるリダイレクト URL とログアウト後の URL、およびその他のプロパティーを指定します。 登録が完了したら、生成されたクライアント ID とシークレットを Quarkus OIDC アプリケーションプロパティーにコピーします。

source: Typically, you must prepare two REST test endpoints. The first endpoint uses the injected MP REST client with a registered token propagation filter to call the second endpoint.
ja_jp: 通常、2 つの REST テストエンドポイントを準備する必要があります。 最初のエンドポイントは、トークン伝播フィルターが登録されている、注入 MP REST クライアントを使用して、2 番目のエンドポイントを呼び出します。

source: Typically, you would need to adapt your build scripts to include the Hibernate Enhancement plugins; in Quarkus this is not necessary as the enhancement step is integrated in the build and analysis of the Quarkus application.
ja_jp: 通常は、ビルドスクリプトにHibernate Enhancementプラグインを含める必要がありますが、QuarkusではEnhancementステップがQuarkusアプリケーションのビルドと分析に統合されているため、その必要はありません。

source: UBI images can be used without any limitations.
ja_jp: UBI イメージは制限なく使用できます。

source: UI Components
ja_jp: UI コンポーネント

source: UI features for assistant-aware components
ja_jp: アシスタント対応コンポーネント用の UI 機能

source: UNIX Domain Socket connections
ja_jp: UNIX ドメインソケット接続

source: UPX compression
ja_jp: UPX圧縮

source: UPX compression can benefit CLI tools or environments where disk space is a constrained resource. For long-running applications or microservices, the RSS overhead reduces the deployment density. So, if the storage is not a problem or if the density of deployment is crucial for you, better not compress your executable.
ja_jp: UPXの圧縮は、CLIツールや、ディスク・スペースが限られたリソースである環境にメリットをもたらします。長時間稼働するアプリケーションやマイクロサービスでは、RSSのオーバーヘッドがデプロイメント密度を低下させます。そのため、ストレージに問題がない場合や、デプロイの密度が重要な場合は、実行可能ファイルを圧縮しない方がよいでしょう。

source: UPX is available on most operating systems. So, you should be able to download it from https://github.com/upx/upx/releases/tag/v3.96[their release page]. UPX is cross-platform. So you can compress a Linux 64 bits executable even from a macOS or Windows machine.
ja_jp: UPXはほとんどのOSで利用できます。そのため、 link:https://github.com/upx/upx/releases/tag/v3.96[リリースページ]からダウンロードできるはずです。UPXはクロスプラットフォームです。そのため、macOSやWindowsマシンからでも、Linux 64ビットの実行可能ファイルを圧縮することができます。

source: UPX is is an open-source, portable, high-performance *executable packer* initially created in 1996. It takes an executable as input and produces a compressed executable. Readers from a _certain_ age may have already used UPX a long time ago when programs needed to be compressed to fit on a floppy disk. More than 20 years later, UPX is still rocking.
ja_jp: UPXは、1996年に開発されたオープンソースのポータブルで高性能な *実行可能ファイルパッカー* です。実行可能ファイルを入力に、圧縮された実行可能ファイルを出力します。昔、フロッピー・ディスクに収めるためにプログラムを圧縮する必要があった頃、 _ある_年代の読者はすでにUPXを使っていたかもしれません。20年以上経った今でも、UPXは健在です。

source: UPX lets you compress your native executables. In Quarkus 2.6, you only need to configure the compression level, and voilà, it compresses it for you.
ja_jp: UPXを使用すると、ネイティブ実行可能ファイルを圧縮することができます。Quarkus 2.6では、圧縮レベルを設定するだけで、自動的に圧縮してくれます。

source: URI records the URI path accessed by the client. This does not include host names or port numbers.
ja_jp: URI は、クライアントがアクセスした URI パスを記録します。 これにはホスト名やポート番号は含まれません。

source: URI template parameter (simplified version of the https://tools.ietf.org/html/rfc6570[URI Template specification]), see <<uri-parameters,URI parameters>> for more information.
ja_jp: URI テンプレートパラメーター (https://tools.ietf.org/html/rfc6570[URI Template specification] の簡易バージョン)。 詳細は、<<uri-parameters,URI parameters>> を参照してください。

source: URI template parameter (simplified version of the https://tools.ietf.org/html/rfc6570[URI Template specification]), see xref:uri-parameters[URI parameters] for more information.
ja_jp: URIテンプレートパラメータ（ link:https://tools.ietf.org/html/rfc6570[URIテンプレート仕様] の簡略版）、詳しくは xref:uri-parameters[URIパラメータ] を参照。

source: URI templates
ja_jp: URIテンプレート

source: URL of our chat.
ja_jp: チャットの URL

source: URL of proxy service. proxyServiceUrl and proxyProtocol must be mutually inclusive.
ja_jp: proxyServiceUrl と proxyProtocol は相互に含める必要があります。

source: URL path may not be the same after the redirect request if a single redirect URL has been registered in the OIDC Provider - the original request path can be restored but after the tenant configuration is resolved
ja_jp: 単一のリダイレクト URL が OIDC プロバイダーに登録されている場合、リダイレクトリクエスト後の URL パスは同じではない可能性があります。元のリクエストパスは復元できますが、それはテナント設定が解決された後です。

source: URL path may not be the same after the redirect request if a single redirect URL has been registered in the OIDC Provider - the original request path can be restored but after the the tenant configuration is resolved
ja_jp: 単一のリダイレクト URL が OIDC プロバイダーに登録されている場合、リダイレクトリクエスト後の URL パスは同じではない可能性があります。元のリクエストパスは復元できますが、それはテナント設定が解決された後です。

source: USAGE
ja_jp: 使用方法

source: UUID generation
ja_jp: UUID の生成

source: Uber Engineering Blog:
ja_jp: Uber Engineering ブログ:

source: Uber-Jar Creation
ja_jp: Uber-Jar 作成

source: Uber-Jar creation by default excludes link:https://docs.oracle.com/javase/tutorial/deployment/jar/intro.html[signature files] that might be present in the dependencies of the application.
ja_jp: デフォルトでは、Uber-Jar の作成は、アプリケーションの依存関係に存在する可能性のある link:https://docs.oracle.com/javase/tutorial/deployment/jar/intro.html[署名ファイル]を除外します。

source: Uber-Jar file name suffix
ja_jp: Uber-Jar のファイル名のサフィックス

source: Uber-Jar's final name is configurable via a Maven's build settings `finalName` option.
ja_jp: Uber-Jarの最終的な名前は、Mavenのビルド設定 `finalName` オプションで設定できます。

source: Ubuntu (21.04 and later)
ja_jp: Ubuntu (21.04以降)

source: Ultimate Packer for eXecutables (UPX) is a compression tool reducing the size of executables.
ja_jp: Ultimate Packer for eXecutables (UPX) は、実行可能ファイルのサイズを縮小する圧縮ツールです。

source: Unassigned `@ConfigProperty` properties (i.e not declared in `application.properties`) in java files, or unknown properties (seemingly unused) declared in `application.properties` can now be excluded from validation via a quick-fix, e.g:
ja_jp: javaファイル中の未割り当ての `@ConfigProperty` プロパティ（すなわち、 `application.properties` で宣言されていない）、または `application.properties` で宣言された未知のプロパティ（未使用と思われる）を、クイックフィックスによって検証から除外できるようになりました：

source: Under no circumstances can the runtime module depend on a deployment artifact. This would result in pulling all the deployment time code into runtime scope, which defeats the purpose of having the split.
ja_jp: いかなる場合でも、実行時モジュールはデプロイメントアーティファクトに依存することはできません。これは、すべてのデプロイメント時のコードが実行時スコープに取り込まれることに繋がり、分割の目的を台無しにします。

source: Under the Cape!
ja_jp: ケープの裏側

source: Under the hood, Quarkus has a reactive engine. This engine, powered by Eclipse Vert.x and Netty, handles the non-blocking I/O interactions.
ja_jp: Quarkusの中身にはリアクティブエンジンがあります。このエンジンは、Eclipse Vert.xとNettyを搭載しており、ノンブロッキングI/Oインタラクションを処理します。

source: Under the hood, Quarkus uses a reactive engine. This engine provides the efficiency and concurrency to cope with modern, containerized, and cloud-native applications.
ja_jp: Quarkusはリアクティブエンジンを採用しています。 このエンジンは、最新のコンテナ化されたクラウドネイティブなアプリケーションに対応する効率性と並行性を提供します。

source: Under the hood, the mechanism uses `org.apache.avro:avro-compiler`.
ja_jp: 内部で、メカニズムは `org.apache.avro:avro-compiler` を使用します。

source: Underlying wire protocol for routing REST calls (see https://tools.ietf.org/html/rfc7230[HTTP specifications])
ja_jp: REST 呼び出しをルーティングするための基本的なワイヤープロトコル (https://tools.ietf.org/html/rfc7230[HTTP 仕様] を参照)

source: Understand what the exception means
ja_jp: 例外の意味を理解する

source: Understanding self-signed versus CA-signed certificates
ja_jp: 自己署名証明書と CA 署名証明書の違いについて

source: Understanding the Apache Incubator
ja_jp: Apache Incubator の理解

source: Understanding the Platform concept
ja_jp: プラットフォームのコンセプトを理解する

source: Undertow configuration
ja_jp: Undertow の設定

source: Unfortunately **that does not scale well**, because it is non-incremental: every time a lesson is assigned to a different time slot or room, all lessons are re-evaluated to calculate the new score.
ja_jp: 残念ながら、増分ではないため、**それはうまくスケーリングされません**。レッスンが異なるタイムスロットまたは教室に割り当てられるたびに、すべてのレッスンが再評価されて新しいスコアが計算されます。

source: Unfortunately generating heap dumps in hprof format, which can be opened by tools such as VisualVM or Eclipse MAT, can only be achieved with https://www.graalvm.org/reference-manual/native-image/NativeImageHeapdump[GraalVM Enterprise Edition]. Mandrel, which is based on the GraalVM Community Edition, does not have this capability.
ja_jp: 残念ながら、VisualVMやEclipse MATのようなツールで開くことができるhprof形式のヒープダンプを生成することは、 link:https://www.graalvm.org/reference-manual/native-image/NativeImageHeapdump[GraalVM Enterprise Edition] でしか実現できません。 GraalVM Community EditionをベースとするMandrelは、この機能を持っていません。

source: Unfortunately the trace output does not take into account the applied configuration filters, so the output contains all configuration decisions made by the agent. This is unlikely to change in the near future (see link:https://github.com/oracle/graal/issues/7635[oracle/graal#7635]).
ja_jp: 残念ながら、トレース出力では、適用された設定フィルターは考慮されません。 したがって、出力にはエージェントによって行われたすべての設定決定が含まれます。 期日中にこれが変わる可能性は低くなっています。 (リンクを参照:https: Oracle/graal/issues/7635[oracle/graal#7635])。

source: Unfortunately, 1.13.5.Final introduced a regression in the Hibernate Validator extension due to a Jandex issue (Jandex is our library indexing the classes and annotations).
ja_jp: 残念ながら、1.13.5.Finalでは、Jandexの問題により、Hibernate Validatorエクステンションにリグレッションが発生しました（Jandexは、クラスやアノテーションのインデックスを作成するライブラリです）。

source: Unfortunately, this only works for `protoc` and not for the Java plugin. The Java plugin is always downloaded.
ja_jp: 残念ながら、これは `protoc` でのみ機能し、Java プラグインでは機能しません。Java プラグインは常にダウンロードされます。

source: Unfortunately, until then, we don't have many options here: we have to list the methods manually.
ja_jp: 残念ながら、それまでは、ここに多くの選択肢はありません。手動でメソッドをリストアップするしかないのです。

source: Unification of Imperative and Reactive
ja_jp: 命令型とリアクティブ型の統一

source: Unified Config
ja_jp: 統一された設定

source: Unified configuration
ja_jp: 統一された設定

source: Unified server mode (Vert.x-based)
ja_jp: 統合サーバーモード (Vert.x ベース)

source: Unifies Imperative and Reactive
ja_jp: 命令型とリアクティブ型の統一

source: Unifies imperative and reactive
ja_jp: 命令型とリアクティブ型の統一

source: Unify Imperative and Reactive:: imperative and reactive. 'Nuff said.
ja_jp: Unify Imperative and Reactive:: 命令型とリアクティブ型。言わずもがなでしょう

source: Unify imperative and reactive
ja_jp: 命令型なものとリアクティブ型を統一する

source: Unifying Imperative and Reactive under one framework.
ja_jp: 命令型とリアクティブを 1 つのフレームワークで統一。

source: Uninstalling the Quarkus Development CA
ja_jp: Quarkus Development CA のアンインストール

source: Uninstalling the Quarkus Development CA depends on your OS.
ja_jp: Quarkus 開発用 CA のアンインストール方法は OS によって異なります。

source: Uninstalling the Quarkus Development CA from your system depends on your OS.
ja_jp: システムから Quarkus Development CA をアンインストールする方法は、OS によって異なります。

source: Unions
ja_jp: ユニオン

source: Unless the custom settings file has been provided with the `-s` argument, this property can be used to point the resolver to a custom Maven settings file
ja_jp: カスタム設定ファイルが `-s` 引数で提供されていない限り、このプロパティを使用してリゾルバにカスタム Maven 設定ファイルを指定できます。

source: Unless you want to, don't worry about setting up an external database to resolve the connection error. Instead, you will go back to using the Dev Service. It made life easy!
ja_jp: 特に必要でなければ、接続エラーを解決するために 外部データベースを設定する必要はありません。代わりに、Dev Service を再び使用します。 その方が簡単です。

source: Unlike Maven, the https://github.com/CycloneDX/cyclonedx-gradle-plugin[Gradle CycloneDX plugin implementation] can be used in Quarkus projects to generate dependency SBOMs, since the implementation manifests dependency configurations registered by configured plugins.
ja_jp: Maven とは異なり、 https://github.com/CycloneDX/cyclonedx-gradle-plugin[Gradle CycloneDX プラグイン実装] は、設定済みプラグインにより登録された依存関係設定を明示するため、Quarkus プロジェクトで依存関係 SBOM を生成するために使用できます。

source: Unlike `invoke`, `call` is asynchronous, and the callback returns a `Uni<?>` object.
ja_jp: `invoke` とは異なり、 `call` は非同期で、コールバックは `Uni<?>` オブジェクトを返します。

source: Unlike `quarkus-websockets`, `quarkus-web-socket-next` does NOT implement https://jakarta.ee/specifications/websocket/[Jakarta WebSocket]. Instead, it provides a simplified and more modern API that is easier to use. It is also designed to work efficiently with Quarkus' reactive programming model and the Quarkus' networking layer.
ja_jp: `quarkus-websockets` とは異なり、`quarkus-web-socket-next` は、https://jakarta.ee/specifications/websocket/[Jakarta WebSocket] を実装しません。 代わりに、より使いやすく簡素化された最新の API を提供します。 また、Quarkus のリアクティブプログラミングモデルおよび Quarkus のネットワーク層と効率的に連携するように設計されています。

source: Unlike `quarkus-websockets`, the `quarkus-websockets-next` extension does **not** implement the Jakarta WebSocket specification. Instead, it introduces a modern API, prioritizing simplicity of use. Additionally, it's tailored to integrate with Quarkus' reactive architecture and networking layer seamlessly.
ja_jp: `quarkus-websockets` とは異なり、 `quarkus-websockets-next` エクステンションは Jakarta WebSocket 仕様を **実装していません**。 代わりに、使いやすさを重視した最新の API を導入しています。 さらに、Quarkus のリアクティブアーキテクチャーおよびネットワーク層とシームレスに統合するように調整されています。

source: Unlike in regular CDI environments the test does not fail if a component injects an unsatisfied dependency. Instead, a synthetic bean is registered automatically for each combination of required type and qualifiers of an injection point that resolves to an unsatisfied dependency. The bean has the `@Singleton` scope so it's shared across all injection points with the same required type and qualifiers. The injected reference is an _unconfigured_ Mockito mock. You can inject the mock in your test using the `io.quarkus.test.InjectMock` annotation and leverage the Mockito API to configure the behavior.
ja_jp: 通常の CDI 環境とは異なり、コンポーネントが満たされていない依存関係を注入してもテストは失敗しません。 代わりに、満たされていない依存関係に解決されるインジェクションポイントの必要なタイプと修飾子の組み合わせごとに、合成 Bean が自動的に登録されます。 Bean には `@Singleton` スコープがあるため、Bean は必要な同じタイプと修飾子を持つすべてのインジェクションポイント間で共有されます。 注入される参照は _未設定_ の Mockito モックです。 `io.quarkus.test.InjectMock` アノテーションを使用してテストにモックを注入し、Mockito API を活用して動作を設定できます。

source: Unlike in the previous example, Stork does not use DNS to locate the Kubernetes service. It uses the Kubernetes API to retrieve the set of pods behind a Kubernetes service. Then, you can apply any Stork service selection or even implement your own.
ja_jp: 前述の例とは異なり、StorkはDNSを使用してKubernetesサービスを探し出しません。Kubernetes APIを使用して、Kubernetesサービスの背後にあるポッドのセットを取得します。その後、Storkのサービス選択を適用したり、独自のサービス選択を実装したりすることができます。

source: Unlike other Wasm runtimes that require platform-specific binaries, Chicory is pure Java.
ja_jp: プラットフォーム固有のバイナリーを必要とする他の Wasm ランタイムとは異なり、Chicory はピュア Java です。

source: Unlike the @BsonCreator approach, `val` cannot be used here. Properties must be defined as `var`, otherwise, the system creates an object with `null` values for every property.
ja_jp: @BsonCreator アプローチとは異なり、ここでは `val` は使用できません。 プロパティは `var` として定義する必要があります。そうしないと、システムはすべてのプロパティに対して `null` 値を持つオブジェクトを作成します。

source: Unlike the `ConsumerRebalanceListener` from Apache Kafka, the `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` methods pass the Kafka Consumer and the set of topics/partitions.
ja_jp: Apache Kafka の `ConsumerRebalanceListener` とは異なり、 `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` メソッドは、Kafka コンシューマーとトピック/パーティションのセットを渡します。

source: Unlike the build configuration options recorded during the `quarkus:build` goal, configuration options saved by `quarkus:track-config-changes` with `dumpCurrentWhenRecordedUnavailable` enabled will include all the build configuration options exposed by a `org.eclipse.microprofile.config.Config` instance. Which means this report may include some build configuration options that will not be used by the Quarkus application build process but also may be missing some build configuration options since MicroProfile Config specification allows configuration sources not to expose all the property names they provide to users.
ja_jp: `quarkus:build` ゴールで記録されたビルド設定オプションとは異なり、 `dumpCurrentWhenRecordedUnavailable` を有効にした `quarkus:track-config-changes` で保存された設定オプションには、 `org.eclipse.microprofile.config.Config` インスタンスにより公開されたすべてのビルド設定オプションが含まれます。 つまり、このレポートには、Quarkus アプリケーションのビルドプロセスでは使用されないビルド設定オプションが含まれている可能性があります。しかし MicroProfile Config 仕様では、設定ソースがユーザーに提供する一部のプロパティー名を非公開にできるため、いくつかのビルド設定オプションが欠落している可能性もあります。
